# 集合与列表、元组的区别：1 不可以重复 2 内部无序，不支持下标访问
# 所以序列（有序的）不包括集合
"""
列表使用：[]
元组使用：()
字符串使用：""
集合使用：{}
"""
# 定义空集合
a = set()  # 定义空序列的时候不管是什么类型，都用小括号?
b = {1, 2, 3, 1, 2, 3}  # 集合会去重
print(a, type(a))
print(b, type(b))

# 添加元素：集合.add(元素)
c = {1, 2, 3}
c.add(9)
print(c)
# 移除元素：集合.remove(元素)
c = {1, 2, 3}
c.remove(2)
print(c)
# 集合中随机取出元素：集合.pop()
c = {4, 4, 3, "1"}
print(c)         # 对数字来说集合按从小到大的顺序排列
print(c.pop())   # 对数字来说不随机，取最小的数

c = {"1", "2", "3", "4"}
print(c)
print(c.pop())
# 清空集合
c = {"1", "2", "3", "4"}
c.clear()
print(c)
# 取两个集合的差集：集合1.difference(集合2)
a = {1, 2, 3}
b = {2, 3, 4}
c = a.difference(b)
print(c)
# 消除集合1中对比集合2相同的部分：集合1.difference_update(集合2)
a = {1, 2, 3}
b = {2, 3, 4}
a.difference_update(b)  # 结果是集合1变了，集合2不变
print(a)
# 合并集合：集合1.union(集合2)
a = {1, 2, 3}
b = {2, 3, 4}
c = a.union(b)
print(c)
# 长度计算len()
c = {"1", "2", "3", "4", "1", "2", "3", "4"}
print(len(c))  # 集合自动去重

# 集合的遍历：可以用for，不能用while，因为不支持下标索引
a = {"1", "2", "3", "4", "1", "2", "3", "4"}
# a = {1, 2, 3, 3}
for x in a:
    print(f"集合的元素为：{x}")

# 作业（信息去重）
list1 = ['1', '2', '1', '2', 'a', 'b', 'a', 'b', 'c']
a = set()
for x in list1:
    a.add(x)
print(a)
